#             지역코드  성별    신용대출     담보대출
# 0     4100000000   1  688608  5706058
# 1     4100000000   2  611035  2260521
# 2     4100000001   1  125392  5946493
# 3     4100000001   2  239679  4711962
# 4     4100000002   1  623758  5411745
# ...          ...  ..     ...      ...
# 4995  4100000511   1  104176  8757588
# 4996  4100000157   2  321815  6782991
# 4997  4100000309   2  519114  6318150
# 4998  4100000341   1  106840  4103058
# 4999  4100000577   1  618898  7612392

# [5000 rows x 4 columns]
# (5000, 4)
# <class 'pandas.DataFrame'>
# RangeIndex: 5000 entries, 0 to 4999
# Data columns (total 4 columns):
#  #   Column  Non-Null Count  Dtype
# ---  ------  --------------  -----
#  0   지역코드    5000 non-null   int64
#  1   성별      5000 non-null   int64
#  2   신용대출    5000 non-null   int64
#  3   담보대출    5000 non-null   int64
# dtypes: int64(4)
# memory usage: 156.4 KB
# None

import pandas as pd

df = pd.read_csv("data/loan.csv")

# print(df)
# print(df.shape)
# print(df.info())

# 1 총대출액 = 신용대출 + 담보대출
df["총대출액"] = (df["신용대출"] + df["담보대출"])
# print(df["총대출액"])

# 2 각 지역코드 내에서, 성별(예 1과 2)별로 '총대출액'의 합계를 계산하시오.
rend_sum = df.groupby(["지역코드", "성별"])["총대출액"].sum().unstack()
# print(rend_sum)
# 성별                 1         2
# 지역코드                          
# 4100000000  22891981  18339609
# 4100000001  34197683  17595557
# 4100000002  13119017  21827691
# 4100000003  16549091  54654134
# 4100000004  26831399  56145359
# ...              ...       ...
# 4100000587   9050332  19445103
# 4100000588  47396699  36281031
# 4100000589  28256320  17797635
# 4100000590  16813363  23655928
# 4100000591  20674327  12204772

# [592 rows x 2 columns]

# 3 성별 간 총대출액의 차이가 가장 큰 지역코드를 구하시오.
print(abs(rend_sum[1] - rend_sum[2]).idxmax()) # 4100000278