import pandas as pd

df = pd.read_csv("data/loan.csv")

# print(df)
# print(df.shape)
# print(df.info())

#             지역코드  성별    신용대출     담보대출                                                                                                                                                       
# 0     4100000000   1  688608  5706058                                                                                                                                                                     
# 1     4100000000   2  611035  2260521                                                                                                                                                                     
# 2     4100000001   1  125392  5946493                                                                                                                                                                     
# 3     4100000001   2  239679  4711962                                                                                                                                                                     
# 4     4100000002   1  623758  5411745                                                                                                                                                                     
# ...          ...  ..     ...      ...                                                                                                                                                                     
# 4995  4100000511   1  104176  8757588                                                                                                                                                                     
# 4996  4100000157   2  321815  6782991                                                                                                                                                                     
# 4997  4100000309   2  519114  6318150                                                                                                                                                                     
# 4998  4100000341   1  106840  4103058                                                                                                                                                                     
# 4999  4100000577   1  618898  7612392                                                                                                                                                                     
                                                                                                                                                                                                          
# [5000 rows x 4 columns]                                                                                                                                                                                   
# (5000, 4)                                                                                                                                                                                                 
# <class 'pandas.DataFrame'>
# RangeIndex: 5000 entries, 0 to 4999
# Data columns (total 4 columns):
#  #   Column  Non-Null Count  Dtype
# ---  ------  --------------  -----
#  0   지역코드    5000 non-null   int64
#  1   성별      5000 non-null   int64
#  2   신용대출    5000 non-null   int64
#  3   담보대출    5000 non-null   int64
# dtypes: int64(4)
# memory usage: 156.4 KB
# None

# 1 총대출액은 신용대출과 담보대출의 합이다
df["총대출액"] = df["신용대출"] + df["담보대출"]
# print(df.head())
#          지역코드  성별    신용대출     담보대출     총대출액
# 0  4100000000   1  688608  5706058  6394666
# 1  4100000000   2  611035  2260521  2871556
# 2  4100000001   1  125392  5946493  6071885
# 3  4100000001   2  239679  4711962  4951641
# 4  4100000002   1  623758  5411745  6035503

# 2 각 지역코드 내에서, 성별별로 총대출액의 합계 계산
df.groupby(["지역코드", "성별"])["총대출액"].sum()
# print(df)

# 3 성별 간 총대출액의 차이가 가장 큰 지역코드를 구하시오.
# df.groupby("지역코드")[""]