import pandas as pd

df = pd.read_csv("data/crime.csv")

# print(df)
# print(df.shape)
# print(df.info())

#       연도    구분  강력범죄  절도범죄  폭력범죄  지능범죄  풍속범죄  특별경제범죄  마약범죄  보건범죄  환경범죄  교통범죄  노동범죄  선거범죄  병역범죄  기타범죄
# 0   2014  발생건수   800   900   750   650   700    1034   600   850   800   900   750   800   700  1000
# 1   2014  검거건수   500   600   400   450   400     961   350   500   450   550   400   450   400   600
# 2   2015  발생건수   900   768   800   750   700    1000   850   800   900   950   800   850   750  1000
# 3   2015  검거건수   600   713   500   550   400     600   500   450   550   600   450   500   400   600
# 4   2016  발생건수   850   800   880   750   700     950   900   800   850   900   750   800   700   950
# 5   2016  검거건수   500   600   812   550   400     600   500   450   500   550   400   450   400   600
# 6   2017  발생건수  1000   900   850   800   750     950  1400   900  1000   950   800   850   750   900
# 7   2017  검거건수   600   500   500   550   400     600  1300   500   550   600   450   500   400   500
# 8   2018  발생건수  1450   900   850   800   750     950   900   800   850   900   750   800   700   950
# 9   2018  검거건수  1350   600   500   550   400     600   500   450   500   550   400   450   400   600
# 10  2019  발생건수  1000   900   850   800   750     950   900  1400  1000   950   800   850   750   900
# 11  2019  검거건수   600   500   500   550   400     600   500  1300   550   600   450   500   400   500
# 12  2020  발생건수  1000   900   850  1500   750     950   900   800   850   900   750   800   700   950
# 13  2020  검거건수   600   500   500  1363   400     600   500   450   500   550   400   450   400   600
# (14, 16)
# <class 'pandas.DataFrame'>
# RangeIndex: 14 entries, 0 to 13
# Data columns (total 16 columns):
#  #   Column  Non-Null Count  Dtype
# ---  ------  --------------  -----
#  0   연도      14 non-null     int64
#  1   구분      14 non-null     str  
#  2   강력범죄    14 non-null     int64
#  3   절도범죄    14 non-null     int64
#  4   폭력범죄    14 non-null     int64
#  5   지능범죄    14 non-null     int64
#  6   풍속범죄    14 non-null     int64
#  7   특별경제범죄  14 non-null     int64
#  8   마약범죄    14 non-null     int64
#  9   보건범죄    14 non-null     int64
#  10  환경범죄    14 non-null     int64
#  11  교통범죄    14 non-null     int64
#  12  노동범죄    14 non-null     int64
#  13  선거범죄    14 non-null     int64
#  14  병역범죄    14 non-null     int64
#  15  기타범죄    14 non-null     int64
# dtypes: int64(15), str(1)
# memory usage: 1.9 KB
# None

# 1 검거율 = 검거건수 / 발생건수
df1 = df[df["구분"] == "발생건수"]
df2 = df[df["구분"] == "검거건수"]
# print(df1)
# print(df2)
#       연도    구분  강력범죄  절도범죄  폭력범죄  지능범죄  풍속범죄  특별경제범죄  마약범죄  보건범죄  환경범죄  교통범죄  노동범죄  선거범죄  병역범죄  기타범죄
# 0   2014  발생건수   800   900   750   650   700    1034   600   850   800   900   750   800   700  1000
# 2   2015  발생건수   900   768   800   750   700    1000   850   800   900   950   800   850   750  1000
# 4   2016  발생건수   850   800   880   750   700     950   900   800   850   900   750   800   700   950
# 6   2017  발생건수  1000   900   850   800   750     950  1400   900  1000   950   800   850   750   900
# 8   2018  발생건수  1450   900   850   800   750     950   900   800   850   900   750   800   700   950
# 10  2019  발생건수  1000   900   850   800   750     950   900  1400  1000   950   800   850   750   900
# 12  2020  발생건수  1000   900   850  1500   750     950   900   800   850   900   750   800   700   950
#       연도    구분  강력범죄  절도범죄  폭력범죄  지능범죄  풍속범죄  특별경제범죄  마약범죄  보건범죄  환경범죄  교통범죄  노동범죄  선거범죄  병역범죄  기타범죄
# 1   2014  검거건수   500   600   400   450   400     961   350   500   450   550   400   450   400   600
# 3   2015  검거건수   600   713   500   550   400     600   500   450   550   600   450   500   400   600
# 5   2016  검거건수   500   600   812   550   400     600   500   450   500   550   400   450   400   600
# 7   2017  검거건수   600   500   500   550   400     600  1300   500   550   600   450   500   400   500
# 9   2018  검거건수  1350   600   500   550   400     600   500   450   500   550   400   450   400   600
# 11  2019  검거건수   600   500   500   550   400     600   500  1300   550   600   450   500   400   500
# 13  2020  검거건수   600   500   500  1363   400     600   500   450   500   550   400   450   400   600

# print(df1[2:])
# df3 = df2[2:]/df1[[2:]]
# print(df3)
df3 = df2[[""]] / df2["강력범죄"]
df3 = df2["강력범죄"] / df2["강력범죄"]
df3 = df2["강력범죄"] / df2["강력범죄"]
df3 = df2["강력범죄"] / df2["강력범죄"]
df3 = df2["강력범죄"] / df2["강력범죄"]
df3 = df2["강력범죄"] / df2["강력범죄"]
print(df3)


# 2 각 연도에서 가장 높은 검거율을 기록한 범죄유형을 찾으시오

# 3 해당 범죄유형의 검거건수를 구한 후, 이 값들을 모두 환산하시오. (정수로)