import pandas as pd

df = pd.read_csv("data/piq.csv")

# print(df)
# print(df.shape)
# print(df.info())

#     PIQ   Brain  Height  Weight
# 0   132   85.78    62.5     127
# 1    96   86.54    68.0     135
# 2    84   90.49    66.3     134
# 3   134   79.06    62.0     122
# 4    86   88.91    70.0     180
# 5   102   83.18    63.0     114
# 6   128  107.95    70.0     151
# 7   128  107.95    70.0     151
# 8   131   93.55    72.0     171
# 9    94   89.40    64.5     139
# 10  131   93.55    72.0     171
# 11  128   96.54    68.8     172
# 12  128   95.50    68.0     132
# 13  150  103.84    73.3     143
# 14  131   93.55    72.0     171
# 15  137   94.96    67.0     191
# 16   89   93.59    75.5     179
# 17  150  103.84    73.3     143
# 18  134   79.06    62.0     122
# 19   81   83.43    66.5     143
# 20  124   92.41    69.0     155
# 21  128   95.50    68.0     132
# 22   84   79.86    68.0     140
# 23   72   79.35    63.0     106
# 24  124   86.67    66.5     159
# 25  120   85.22    68.5     127
# 26   96   86.54    68.0     135
# 27  128   96.54    68.8     172
# 28   74   93.00    74.0     148
# 29   98   85.43    66.0     175
# 30  134   79.06    62.0     122
# 31  147   95.55    68.8     172
# 32   84   80.80    66.3     136
# 33  134   95.15    65.0     147
# 34   84   79.86    68.0     140
# 35   90   87.89    66.0     146
# 36  147   95.55    68.8     172
# 37  110  106.25    77.0     187
# 38  150  103.84    73.3     143
# 39   84   90.59    76.5     186
# 40  124   86.67    66.5     159
# 41   98   85.43    66.0     175
# 42   84   90.49    66.3     134
# 43  124   94.94    70.5     144
# 44   90   87.89    66.0     146
# 45  102   94.51    73.5     178
# 46   94   89.40    64.5     139
# 47  134   95.15    65.0     147
# 48  150  103.84    73.3     143
# 49  131   99.13    64.5     138
# (50, 4)
# <class 'pandas.DataFrame'>
# RangeIndex: 50 entries, 0 to 49
# Data columns (total 4 columns):
#  #   Column  Non-Null Count  Dtype  
# ---  ------  --------------  -----  
#  0   PIQ     50 non-null     int64  
#  1   Brain   50 non-null     float64
#  2   Height  50 non-null     float64
#  3   Weight  50 non-null     int64  
# dtypes: float64(2), int64(2)
# memory usage: 1.7 KB
# None

# 종속변수와 독립변수로 다중 회귀 분석 -> p-value가 가장 작은 변수의 회귀 계수 계산
from statsmodels.formula.api import ols

model = ols("PIQ ~ Brain + Height + Weight", data=df).fit()
# print(model.summary()) # 2.343
#                             OLS Regression Results                            
# ==============================================================================
# Dep. Variable:                    PIQ   R-squared:                       0.370
# Model:                            OLS   Adj. R-squared:                  0.329
# Method:                 Least Squares   F-statistic:                     9.024
# Date:                Fri, 19 Jun 2026   Prob (F-statistic):           8.25e-05
# Time:                        14:49:31   Log-Likelihood:                -217.27
# No. Observations:                  50   AIC:                             442.5
# Df Residuals:                      46   BIC:                             450.2
# Df Model:                           3                                         
# Covariance Type:            nonrobust                                         
# ==============================================================================
#                  coef    std err          t      P>|t|      [0.025      0.975]
# ------------------------------------------------------------------------------
# Intercept     74.5114     50.564      1.474      0.147     -27.269     176.292
# Brain          2.3431      0.456      5.141      0.000       1.426       3.261
# Height        -2.6444      1.064     -2.485      0.017      -4.786      -0.503
# Weight         0.0406      0.167      0.243      0.809      -0.296       0.377
# ==============================================================================
# Omnibus:                        8.608   Durbin-Watson:                   2.386
# Prob(Omnibus):                  0.014   Jarque-Bera (JB):                2.629
# Skew:                           0.041   Prob(JB):                        0.269
# Kurtosis:                       1.880   Cond. No.                     3.48e+03
# ==============================================================================

# 문제 1에 적합한 모델의 결정계수 R-squared 값 구하기 # 0.37
# print(round(model.rsquared,2))

# brain = 90 height = 70 weight = 150
new = pd.DataFrame({"Brain":[90], "Height":[70], "Weight":[150]})
pred = model.predict(new).iloc[0]
print(round(pred)) #106